
&НаКлиенте
Процедура КомандаЗаполнитьПользователей(Команда)
	ЗаполнитьПользователей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователей()
	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		//Получим из регистра уже исключенных пользователей
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсключаемыеПользователи.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ИсключаемыеПользователи КАК ИсключаемыеПользователи
			|ГДЕ
			|	ИсключаемыеПользователи.ИнформационнаяБаза = &ИнформационнаяБаза";
		
		Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
		ТблИскл = Запрос.Выполнить().Выгрузить();
		
		//Получим таблицу работающих сотрудников
		фПервая = Истина;
		Для Каждого ХХХ Из ИнформационнаяБаза.БазыЗУП Цикл
			СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
			ЗаполнитьЗначенияСвойств(СткЗапроса,ХХХ.БазаЗУП);
			СткЗапроса.ИНН = ХХХ.БазаЗУП.Организация.ИНН;
			СткЗапроса.ИмяМетода = "GETRABSOTR";
			Если фПервая Тогда
				ТБл = ОбщегоНазначения.ПолучитьКадрТбл(СткЗапроса);
				фПервая = Ложь;
			Иначе
				ТБл1 = ОбщегоНазначения.ПолучитьКадрТбл(СткЗапроса);
				Для Каждого стр Из ТБл1 Цикл
					нСтр = ТБл.Добавить();
					ЗаполнитьЗначенияСвойств(нСтр,стр);
				КонецЦикла;	
			КонецЕсли	
			
		КонецЦикла;
		ТБл.Свернуть("ФИО");
		ТЗРаботающие.Загрузить(Тбл);
		
		//Получим массив пользователей информационной базы
		СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
		ЗаполнитьЗначенияСвойств(СткЗапроса,ИнформационнаяБаза);
		СткЗапроса.ИмяМетода = "USERSLIST";
		СписокПользователей.Очистить();
		ОшибкаHTTP = "";
		Мас = ОбщегоНазначения.ВыполнитьЗапрос(СткЗапроса,ОшибкаHTTP);
		//!!!ПРОБЛЕМА
		Если ТипЗнч(Мас) <> Тип("Массив") Тогда
			Сообщить("Не удалось получить массив пользователей. " + ОшибкаHTTP);
			Возврат;
		КонецЕсли;	
		
		
		Для каждого ХХХ Из Мас Цикл
			нСтр = СписокПользователей.Добавить();
			ЗаполнитьЗначенияСвойств(нСтр,ХХХ);
			
			СтруктураПоиска = Новый Структура("ФИО", ХХХ.ПолноеИмя); 
			МассивНайденныхСтрок = ТБл.НайтиСтроки(СтруктураПоиска); 	
			нСтр.фРаботник = (МассивНайденныхСтрок.Количество() <> 0);
			
			СтруктураПоиска = Новый Структура("Пользователь", ХХХ.ПолноеИмя); 
			МассивНайденныхСтрок = ТблИскл.НайтиСтроки(СтруктураПоиска); 	
			нСтр.фИсключаемый = (МассивНайденныхСтрок.Количество() <> 0);
			
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры
