
&НаКлиенте
Процедура ИнформационнаяБазаПриИзменении(Элемент)
	ЗаполнитьПользователей();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПользователей()
	Если ЗначениеЗаполнено(Объект.ИнформационнаяБаза) Тогда
		
		//Получим из регистра уже исключенных пользователей
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсключаемыеПользователи.Пользователь КАК Пользователь
			|ИЗ
			|	РегистрСведений.ИсключаемыеПользователи КАК ИсключаемыеПользователи
			|ГДЕ
			|	ИсключаемыеПользователи.ИнформационнаяБаза = &ИнформационнаяБаза";
		
		Запрос.УстановитьПараметр("ИнформационнаяБаза", Объект.ИнформационнаяБаза);
		ТблИскл = Запрос.Выполнить().Выгрузить();
		Объект.ИсключаемыеПользователи.Загрузить(ТблИскл);
		
		//Получим таблицу работающих сотрудников
		фПервая = Истина;
		Для Каждого ХХХ Из Объект.ИнформационнаяБаза.БазыЗУП Цикл
			СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
			ЗаполнитьЗначенияСвойств(СткЗапроса,ХХХ.БазаЗУП);
			СткЗапроса.ИНН = ХХХ.БазаЗУП.Организация.ИНН;
			СткЗапроса.ИмяМетода = "GETRABSOTR";
			Если фПервая Тогда
				ТБл = ОбщегоНазначения.ПолучитьКадрТбл(СткЗапроса);
				фПервая = Ложь;
			Иначе
				ТБл1 = ОбщегоНазначения.ПолучитьКадрТбл(СткЗапроса);
				Для Каждого стр Из ТБл1 Цикл
					нСтр = ТБл.Добавить();
					ЗаполнитьЗначенияСвойств(нСтр,стр);
				КонецЦикла;	
			КонецЕсли	
			
		КонецЦикла;
		ТБл.Свернуть("ФИО");
		
		
		
		Объект.ПользователиИБ.Очистить();
		//Получим массив пользователей информационной базы
		СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
		ЗаполнитьЗначенияСвойств(СткЗапроса,Объект.ИнформационнаяБаза);
		СткЗапроса.ИмяМетода = "USERSLIST";
		Объект.ПользователиИБ.Очистить();
		Мас = ОбщегоНазначения.ВыполнитьЗапрос(СткЗапроса);
		Для каждого ХХХ Из Мас Цикл
			
			СтруктураПоиска = Новый Структура("ФИО", ХХХ.ПолноеИмя); 
			МассивНайденныхСтрок = ТБл.НайтиСтроки(СтруктураПоиска); 	
			фРаботник = (МассивНайденныхСтрок.Количество() <> 0);
			Если фРаботник Тогда
				Продолжить;
			КонецЕсли;	
			
			СтруктураПоиска = Новый Структура("Пользователь", ХХХ.ПолноеИмя); 
			МассивНайденныхСтрок = ТблИскл.НайтиСтроки(СтруктураПоиска); 	
			фИсключаемый = (МассивНайденныхСтрок.Количество() <> 0);
			Если фИсключаемый Тогда
				Продолжить;
			КонецЕсли;	
			
			нСтр = Объект.ПользователиИБ.Добавить();
			нСтр.Пользователь = ХХХ.ПолноеИмя;
			нСтр.Имя = ХХХ.Имя;
			
			
			//СтруктураПоиска = Новый Структура("ФИО", ХХХ.ПолноеИмя); 
			//МассивНайденныхСтрок = ТБл.НайтиСтроки(СтруктураПоиска); 	
			//нСтр.фРаботник = (МассивНайденныхСтрок.Количество() <> 0);
			
			
			
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВыделенныеСлева(Команда)
	стрПереченьПользователей = "";
	Для Каждого ХХХ Из Объект.ПользователиИБ Цикл
		Если ХХХ.ФлагВыбора = Истина Тогда
			Отбор = Новый Структура;
			Отбор.Вставить("Пользователь", ХХХ.Пользователь);
			Мас = Объект.ИсключаемыеПользователи.НайтиСтроки(Отбор);			
			Если Мас.Количество() = 0 Тогда
				нСтр = Объект.ИсключаемыеПользователи.Добавить();
				нСтр.Пользователь = ХХХ.Пользователь;
			Иначе	
				стрПереченьПользователей = стрПереченьПользователей + ХХХ.Пользователь + Символы.ПС;
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	
	Если стрПереченьПользователей <> "" Тогда
		тПредупреждения = "Внимание!" + Символы.ПС + Символы.ПС + "Вы повторно пытаетесь добавить пользователей, 
						|которые уже содержатся в списке исключаемых.
						|Эти пользователи не будут повторно перенесены." + Символы.ПС + Символы.ПС + стрПереченьПользователей;
		ПоказатьПредупреждение(, тПредупреждения);
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура КомандаПеренестиВыделенныеСправа(Команда)
	Для Каждого ХХХ Из Объект.ИсключаемыеПользователи Цикл
		Если ХХХ.ФлагВыбора = Истина Тогда
			Объект.ИсключаемыеПользователи.Удалить(ХХХ);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗаписатьРегистр(Команда)
	ЗаписатьРегистр();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистр()
	НаборЗаписей = РегистрыСведений.ИсключаемыеПользователи.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(Объект.ИнформационнаяБаза); 
	НаборЗаписей.Записать();
	Для Каждого ХХХ Из Объект.ИсключаемыеПользователи Цикл 
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ИнформационнаяБаза = Объект.ИнформационнаяБаза; 
		НоваяЗапись.Пользователь = ХХХ.Пользователь; 
	КонецЦикла; 
	НаборЗаписей.Записать();    
КонецПроцедуры

