&НаКлиенте
Процедура окоПутьДоФайлаДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки процедуры
	СтандартнаяОбработка = Ложь;
	// Создаем диалог выбора файла и указываем для чего он будет использоваться
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	// Задаем фильтр доступных расширений файлов для выбора
	Диалог.Фильтр = "Текстовые файлы(*.txt;*.txt)";
	// Задаем текст заголовка окна выбора
	Диалог.Заголовок = НСтр("Выберите текстовый файл");
	// Создаем объект ОписаниеОповещения, который будет передан в метод Показать
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаЗавершение",  ЭтотОбъект, Диалог);
	// Открываем окно выбора файла
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПолноеИмяФайла = ВыбранныеФайлы[0];
		НаборКонстант.окоПутьДоФайлаДанных = ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры