&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Стк = Обработки.РабочийСтолПроектОКО.ПолучитьОсновныеТаблицы();	
	Если ТипЗнч(Стк) <> Тип("Структура") Тогда
		Сообщить(Стк);
		Возврат;
	КонецЕсли;	
	
	Для Каждого ХХХ Из Стк.тбИсклОб Цикл
		Если ХХХ.ТипОбъекта = "ТС" Тогда
			нСтр = ИсключаемыеТС.Добавить();
			нСтр.ГаражныйНомер = ХХХ.КодОбъекта;
		Иначе
			нСтр = ИсключаемыеПодразделения.Добавить()
		КонецЕсли;	
		ЗаполнитьЗначенияСвойств(нСтр,ХХХ);
	КонецЦикла;	
	
	
	//Организуем получение и раскраску строк в таблицах гаража и ремонта в зависимости от цвета гаража
	Для Каждого ХХХ Из Стк.тбГар Цикл
		Если СокрЛП(ХХХ.НаименованиеГеозоны) = "" Тогда
			Продолжить;
		КонецЕсли;	
		Цвет = ХХХ.ЦветГаража.получить();
		нСтр = Гаражи.Добавить();
		ЗаполнитьЗначенияСвойств(нСтр,ХХХ);
		нСтр.ЦветГаража = ХХХ.ЦветГаража.получить();
	КонецЦикла;	
	РаскрасимТаблицуГаражей(Стк.тбГар); //ПОКА ЧЕГО-ТО НЕ РАСКРАШИВАЕТСЯ
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписатьИЗакрыть(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура РаскрасимТаблицуГаражей(спГаражей)
	Для Каждого ХХХ Из спГаражей Цикл 
		ЦветГаража = ХХХ.ЦветГаража.Получить();
		Если ЦветГаража <> Неопределено тогда
			
			Оформление  = УсловноеОформление.Элементы.Добавить();
			Оформление.Использование = Истина;
			Поле1 = Оформление.Поля.Элементы.Добавить();
			Поле1.Поле = Новый ПолеКомпоновкиДанных("ГаражиНаименование");
			Поле2 = Оформление.Поля.Элементы.Добавить();
			Поле2.Поле = Новый ПолеКомпоновкиДанных("ГаражиНаименованиеГеозоны");
			Отбор = Оформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Гаражи.Наименование");
			Отбор.ПравоеЗначение = ХХХ.Наименование; 
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование = Истина;
			Оформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветГаража);	
			
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

