
&НаКлиенте
Процедура КомандаВыполнить(Команда)
	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		ВыполнитьОбработкуНаСервере();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбработкуНаСервере()
	Обр = Обработки.СинхронизацияСигур;
	Обр.ВыполнитьОбработкуИБ(ИнформационнаяБаза);
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицы()
	Обр = Обработки.СинхронизацияСигур;
	вМассив = Новый Массив;
	Обр.ВыполнитьОбработкуИБ(ИнформационнаяБаза, вМассив);
	Возврат вМассив;
КонецФункции

&НаКлиенте
Процедура КомандаПоказатьТаблицы(Команда)
	Если ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		мМассивТД = ПолучитьТаблицы();
		Для Каждого мТабличныйДокумент Из мМассивТД Цикл
			мТабличныйДокумент.Показать();
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры
