
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СформироватьНаименование();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаименование()
	Объект.Наименование = Объект.Организация.Наименование + " - " + Строка(Объект.ТипИнформационнойБазы) + ?(ЗначениеЗаполнено(Объект.СтрокаСоединенияСигур), " (Сигур)", "");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
	ЗаполнитьЗначенияСвойств(СткЗапроса,Объект);
	СткЗапроса.ИмяМетода = "TEST";
	Результат = ВыполнитьЗапрос(СткЗапроса);
	Если Результат <> 1 Тогда
		ПоказатьПредупреждение(,"Подключение прошло успешно!",,"ВНИМАНИЕ!!!");
	Иначе
		ПоказатьПредупреждение(,"Подключение не удалось!",,"ВНИМАНИЕ!!!");
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыполнитьЗапрос(СткЗапроса) Экспорт
	Соединение = Новый HTTPСоединение(
									СткЗапроса.АдресСервера, 			// сервер (хост)
									80, 					// порт, по умолчанию для http используется 80, для https 443
									СткЗапроса.Логин, 		// пользователь для доступа к серверу (если он есть) 
									СткЗапроса.Пароль,	 	// пароль для доступа к серверу (если он есть) 
									, 						// здесь указывается прокси, если он есть
									, 						// таймаут в секундах, 0 или пусто - не устанавливать
															// защищенное соединение, если используется https
									);
									
	ТекстЗапроса ="/" + СткЗапроса.НаименованиеБазы + "/hs/"+ СткЗапроса.АПИ + "/" + СткЗапроса.ИмяМетода;
	
	
	Запрос = Новый HTTPЗапрос(ТекстЗапроса);
	Ответ = Соединение.Получить(Запрос);
	КодСостояния = Ответ.КодСостояния;
	Если КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Возврат ТелоОтвета;
	Иначе
		Возврат 1;
	КонецЕсли;	
КонецФункции

&НаКлиенте
Процедура КомандаПроверитьGETPROZR(Команда)
	ПроверитьGETPROZR();
КонецПроцедуры

&НаСервере
Процедура ПроверитьGETPROZR()
	Ошибка = "";
	СткЗапроса = ОбщегоНазначения.ПолучитьСткЗапроса();
	ЗаполнитьЗначенияСвойств(СткЗапроса, Объект);
	СткЗапроса.ИмяМетода = "GETPROZR";
	Результат = ОбщегоНазначения.ВыполнитьЗапрос(СткЗапроса,Ошибка);
КонецПроцедуры